{
 "settings": {
	"intro": "offers the possibility to create customized LED Ring animations. The animations can be selected with flow cards and played for an adjustable time.",
	"header_editor": "LED editor",
	"header_generator": "Animation generator",
	"header_randomizer": "Randomizer",
	"header_frame": "&nbsp;Frame",
	"header_colors": "&nbsp;Color pattern",
	"header_export": "Save LEDitor animation",
	"header_settings": "LEDitor settings",
	"txt_empty_preset": "New",

	"title_but_copy_ani": "Copy mode",
	"title_dropAnimation": "Select animation",
	"title_but_rename_ani": "Rename",
	"title_butPlay": "Play on screen",
	"title_butPreview": "Play on LED ring",
	"title_but_view_frames": "Change display type",

	"title_but_ani_store": "Save LEDitor animation",
	"title_but_ani_open": "Open LEDitor animation",
	"title_but_image_import": "Image as source for animation",
	"title_but_frame_add": "Add a new frame after frame ###",
	"title_but_frame_copy": "Duplicate frame ###",
	"title_but_ani_fill_flow": "Fill empty frames smoothly. Fixed position",
	"title_but_ani_fill_connect": "Fill empty frames smoothly. Variable position",
	"title_but_ani_delete": "Clear this animation",

	"title_but_editor_generator": "Animation generator",
	"title_but_editor_leds": "LED editor",
	"title_but_editor_randomizer": "Randomizer",

	"title_but_frame_clock": "Move clockwise",
	"title_but_frame_counterclock": "Move counterclockwise",
	"title_but_frame_push": "Move backwards",
	"title_but_frame_pull": "Move forward",
	"title_but_edit_fill": "Solid fill",
	"title_but_edit_flow": "Gradient fill",

	"title_dropFillType": "Kind of operation",
	"title_dropFillRange": "Range of operation",
	"title_but_color_acquire": "Use the color of an LED",

	"title_but_color_select_type": "Switch between pallet and advanced color selection",
	"title_but_color_select_cancel": "Cancel color selection",
	"title_but_color_select_accept": "Use selected color",

	"title_but_settings": "LEDitor settings",
	"title_but_edit_undo": "Undo",
	"title_but_edit_redo": "Redo",

	"title_but_open_image": "Open an image",
	"title_but_view_import": "Change display type",
	"title_but_scan_direction": "Scan direction",
	"title_but_import_cancel": "Cancel",
	"title_but_import_accept": "Accept",

	"txt_view_colors": "Pixel display",
	"txt_view_led": "LED display",
	"txt_view_ledring": "Ring display",
	"txt_check_all_frames": "All frames",
	"txt_check_each_led": "Each LED",


	"frame_count": "Frames",
	"txt_move_up": "Move up",
	"txt_move_down": "Move down",
	"txt_remove": "Remove",
	"txt_off": "Off",
	"txt_same": "Same",
	"txt_inverted": "Inverted",

	"txt_processing": "Operation",
	"txt_solid": "Solid",
	"txt_led_setting": "LED setting",
	"txt_range": "Range",
	"txt_drop_type_1": "One or more",
	"txt_drop_type_2": "Skip to...",
	"txt_drop_type_3": "Fill with gradient",
	"txt_drop_range_t1": "### LED",
	"txt_drop_range_t2": "every ### LED",
	"txt_drop_range_t3": "inactive LEDs",
	"txt_plural_s": "s",
	"txt_select": "Select",

	"txt_first_color": "First color",
	"txt_second_color": "Second color",
	"txt_third_color": "Third color",
	"txt_flow_to": "Gradient to",
	"txt_ring_color": "Ring color",

	"txt_random_colors": "Random colors",
	"txt_full_flow": "Full gradient",
	"txt_set_user_color": "Save preferred color",
	"txt_no_color": "No color - LED off",
	"txt_pure_red": "red",
	"txt_pure_green": "green",
	"txt_pure_blue": "blue",
	"txt_pure_yellow": "yellow",
	"txt_pure_magenta": "magenta",
	"txt_pure_cyan": "cyan",
	"txt_bright_white": "white",
	"txt_direct_select": "Select directly",

	"count0": "every",
	"count1": "1st",
	"count2": "2nd",
	"count3": "3rd",
	"count4": "4th",
	"count5": "5th",
	"count6": "6th",
	"count7": "7th",
	"count8": "8th",
	"count9": "9th",
	"count10": "10th",
	"count11": "11th",
	"count12": "12th",
	"txt_ledring": "LED ring display is approximate",

	"txt_import_start": "Start here and open an image.",
	"txt_led_colors": "Imported frames",
	"txt_image_selection": "Image selection",
	"txt_dimmer": "Dimmer",
	"txt_hue": "Hue",
	"txt_saturation": "Saturation",
	"txt_lightness": "Lightness",
	"txt_brightness": "Brightness",
	"txt_zoom": "Zoom",
	"txt_wrong_image": "contains no valid LEDitor data!",
	"txt_left_right": "Left to right",
	"txt_top_bottom": "Top to bottom",
	"txt_save_animation": "Click the image above to save the LEDitor animation.<br>With Homey Desktop you'll get a dialog window to select where you want to store the image.<br><br>Google Chrome stores the image directly in your default Download folder.<br>If you want a dialog window with Chrome then Right-Click the image and select 'Save link as...'.<br><br>Anybody can import this image into LEDitor to recreate your animation including the original settings.<br>Do not edit the image afterwards as this will damage the settings!",

	"txt_generator_0": "* Choose generator *",
	"txt_generator_1": "Alert",
	"txt_generator_2": "Flash",
	"txt_generator_3": "Solid",
	"txt_generator_4": "Breathing",
	"txt_generator_5": "Sparkle",
	"txt_generator_6": "Satellite",
	"txt_generator_7": "Lighthouse",
	"txt_generator_8": "Clockwork",
	"txt_generator_9": "Butterfly",
	"txt_generator_10": "Triangle",
	"txt_generator_11": "Pulse train",
	"txt_generator_12": "Frontal pulse",
	"txt_generator_13": "Pulsar",
	"txt_generator_14": "Oncoming",
	"txt_generator_15": "Newton lights",
	"txt_generator_16": "Scanner",
	"txt_generator_17": "Gort",
	"txt_generator_18": "Eyes",

	"txt_randomizer_hue": "Hue randomly",
	"txt_randomizer_sat": "Saturation randomly",
	"txt_randomizer_bright": "Brightness randomly",
	"txt_randomizer_position": "Position randomly",

	"txt_settings_gamma": "Gamma for on-screen LED colors",
	"txt_settings_show_info": "Show header and control information",
	"txt_settings_show_homey": "Show LED operations on Homeys LED Ring",
	"txt_settings_show_homey_time_pre": "for",
	"txt_settings_show_homey_time_post": "seconds",

	"message_load_animation": "Loading animation...",
	"message_prepare_animation": "Preparing on-screen animation...",
	"message_send_animation": "Sending animation to Homey...",
	"message_open_image": "The image is being read...",

	"help_but_copy_ani_A": "Activate Copy mode to replace the selected animation with a copy of the subsequent selection. <br> Example: Select animation 1, activate Copy mode, choose animation 3. Animation 1 is now replaced with a copy of animation 3.",
	"help_but_copy_ani_B": "Deactivate Copy mode.",
	"help_dropAnimation_A": "Select an animation. Any changes to the current animation can no longer be undone automatically. Manual changes are always possible.",
	"help_dropAnimation_B": "COPY MODE: The current animation is replaced by a copy of the animation to be selected.",
	"help_but_rename_ani": "Change the name of the selected animation. In addition to letters and numbers, most punctuation marks are allowed. Press [Enter] to assign the new name to the animation, or press [Esc] to cancel and preserve the current name.",
	"help_inName": "Enter a new name here and press [Enter]. Press [Esc] to cancel.",
	"help_inFPS": "FPS = Frames Per Second. This setting determines how many LED frames per second are displayed.",
	"help_inTFPS": "VFPS = Virtual Frames Per Second. This setting determines the final speed at which the LED ring changes. When VFPS is higher than FPS, Homey will insert the missing frames. A value equivalent to FPS ensures an immediate frame change. A high setting (from 25-30 VFPS) results in a smooth display.",
	"help_inRPM": "RPM = Rotations Per Minute. How many times per minute the whole animation completes a revolution. 0 = Stationary with LED 1 facing forward. At positive values, the ring turns clockwise, and negative values turn the ring counterclockwise.",
	"help_butPlay": "Play an example animation on the screen. This may be useful when Homey is unavailable. This display is only approximately the same as the actual LED ring display.",
	"help_butPreview": "Play the animation with Homey. You can optionally set a number of repetitions so the transition from the end to the beginning of the animation becomes clearly visible.",
	"help_inRepeat": "How many times should Homey repeat the animation test.",
	"help_tableFrames": "This is a display of the frames. Larger markers show LEDs 1 (front), 7 (left), 13 (rear) and 19 (right). LED 1 is visible in the center while LED 13 is visible both left and right on the bar to emphasize the circular reality. Select a frame to see the ring view and make any adjustments.",
	"help_but_view_frames": "Select a type of display for the list of frames. 'Pixel display' = Simple colors. 'LED display' = Light-related, with the brightness difference between the individual LEDs clearly visible. 'Ring display' = Related to the LED Ring, with the final result being reasonably well visible.",

	"help_butTopColor": "Choose a background color for the screen views. Possible are black, 33% gray, 66% gray and white. This can help to better recognize very dark or very bright, near-white colors.",
	"help_ledMarker_A": "Perform operation. Move your mouse over these LED markers to see which LEDs will be edited with the current setting. Click on a marker to perform the selected operation.",
	"help_ledMarker_B": "Acquire color. Move your mouse over these LED markers to see which color will be acquired. Click on a marker to acquire its color and use it for further editing.",
	"help_colPreview": "Select an edit color or choose 'off'. You can use a 19-color pallet in various brightnesses, or switch to advanced color settings to set your preference tones exactly.",
	"help_but_color_acquire": "Enable this feature and click an LED marker to use the color as the edit color.",
	"help_dropFillType": "Choose a kind of operation.",
	"help_dropFillType1": "'#1#' = Edit 1 LED or a number of consecutive LEDs.",
	"help_dropFillType1ext": "",
	"help_dropFillType2": "'#2#' = Skip one or more LEDs before editing the next one.",
	"help_dropFillType2ext": "",
	"help_dropFillType3": "'#3#' = A group of inactive LEDs inbetween 2 active LEDs gets a smooth gradient.",
	"help_dropFillType3ext": "If only 1 LED is on or when the two adjacent LEDs are the same color, a solid fill will be performed.",
	"help_dropFillRange": "Select the operation range for",

	"help_but_frame_clock": "Turn the colors clockwise.",
	"help_but_frame_counterclock": "Turn the colors counterclockwise.",
	"help_but_frame_push": "Move the colors at the left and right backwards. LEDs 1 and 13 do not change.",
	"help_but_frame_pull": "Move the colors at the left and right forward. LEDs 1 and 13 do not change.",
	"help_but_edit_fill": "Solid fill. Each inactive LED gets the same color as the previous active LED.",
	"help_but_edit_flow": "Color gradient fill. All inactive LEDs form a smooth gradient between the active LEDs. Unlike the 'Fill with gradient' function, this feature edits all inactive sections simultaneously.",
	"help_dropFlowType": "A gradient fill can be performed in three ways. HSB 1: Hue, Saturation and Brightness of the initial LED will be adjusted to the values of the end LED over the shortest distance on the color circle. HSB 2: Like HSB 1, but over the longest distance on the color circle. RGB: Adjusts the Red, Green, and Blue values from the start LED to the values of the end LED.",
	"help_checkAllFrames": "Rotate or fill all frames at once.",
	"help_but_ani_open": "Open a LEDitor animation. In addition to the colors for the LEDs, these PNG files contain the animation name and settings for FPS, VFPS, and RPM. The current animation #1# (#2#) will be replaced by the opened animation.",
	"help_but_ani_store": "Save LEDitor animation #1# (#2#). It is saved as a PNG image and contains the animation name and settings for FPS, VFPS, and RPM in addition to the colors for the LEDs. These images can be used as backup and shared with other users.",
	"help_but_export_cancel": "Leave animation export and return to the editor.",

	"help_but_editor_randomizer": "Change hue, saturation, brightness and position of active LEDs randomly. The maximum changes are adjustable from very subtle to fully chaotic.",
	"help_but_editor_generator": "With the animation generator you can generate an LED ring animation by a few mouse clicks. You can choose from all the patterns of the 'LED Ring Collection' and set the colors and a number of parameters.",
	"help_but_editor_leds": "Use the LED ring editor for manual adjustments of the LEDs. Use functions to rotate and fill a frame.",
	"help_but_frame_add": "Add a new frame after the selected frame.",
	"help_but_frame_copy": "Add a copy after the selected frame.",
	"help_but_ani_fill_flow": "Frames without active LEDs are filled with a gradient composed of the colors of the adjacent frames with active LEDs.",
	"help_but_ani_fill_connect": "Frames without active LEDs are filled with a gradient composed of the colors of the adjacent frames with active LEDs. The position of the active LEDs in the frame preceding the inactive section will then change to the position of the nearest active LED in the frame following the inactive section.",
	"help_but_ani_delete": "Remove all frames of this animation and start creating a new animation.",
	"help_but_image_import": "Use an image as animation source. Animation #1# (#2#) will be replaced by frames that are formed from the pixels of a self-chosen image. Use various settings to adjust the colors. The number of frames is adjustable from 1 to 200.",
	"help_but_edit_undo": "Undo the last edit. This is possible until you select another animation or leave this settings page.",
	"help_but_edit_redo": "Redo the undone edit. This is possible until you select another animation or leave this settings page.",

	"help_but_view_frames": "Select a type of display for the list of imported frames. 'Pixel display' = Simple colors. 'LED display' = Light-related, with the brightness difference between the individual LEDs clearly visible. 'Ring display' = Related to the LED Ring, with the final result being reasonably well visible.",
	"help_sliderDimmer": "Use Dimmer to darken the original colors. This prevents adjacent colors from mixing too much, which can result in a boring, almost white-lit LED ring. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderHue": "Hue allows you to customize the color spectrum of an image. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderSaturation": "Use Saturation to make dull colors brighter and vice versa. Use the minimum setting for grayscale / white levels. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderLightness": "Lightness makes the colors darker or brighter, somewhat similar to contrast control. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderZoom": "Use Zoom to increase a particular part of an image. The last mouse click in an image determines the center of magnification. Use your mouse wheel or cursor keys for fine tuning. A double click shows the full image.",
	"help_but_open_image": "Open an image as a source for frames and LED colors.",
	"help_but_scan_direction": "Select whether the frames are scanned from left to right, or from top to bottom.",
	"help_inFrames": "Determine the number of frames in which the selection is divided.",
	"help_canvImage": "Click on the image to determine the center of the part to be used. This is also the point that may be zoomed in.",
	"help_importArea": "This image area is used to import the frames and colors and also displays the gamma correction for display / LEDs and any manual color adjustments. Move the mouse in the longitudinal direction to view the frames in the matrix view.",
	"help_canvImportedFrames": "Here you will see how the colors from an image are used in frames. Frames are displayed from top to bottom. Each frame displays 24 LED colors from left to right. The central vertical marker shows the position of LED 1.",
	"help_but_import_cancel": "Return to the editor without importing the image. As long as you do not leave the LEDitor settings, you can return here to continue working with the current image.",
	"help_but_import_accept": "Accept the displayed settings. Animation #1# (#2) will be erased and replaced by the chosen image frames. As long as you do not leave the LEDitor settings, you can return here to make adjustments.",

	"help_dropGenerator": "Select a generator.",
	"help_checkRandomColors": "Use random colors for the generator.",
	"help_checkFullFlow": "Use a full gradient (red, yellow, green, cyan, blue and magenta) for the generator.",
	"help_generatorCol1": "Select the first color for the generator.",
	"help_generatorCol1_flow": "If the second color is not -off-, then the first color will be the start of a gradient to the second color.",
	"help_generatorCol2": "Select the second color for the generator.",
	"help_generatorCol2_flow": "This wil be the end color of a two color gradient.",
	"help_generatorCol3": "Select the third color for the generator.",
	"help_inGenFrame": "How many frames will be used for the animation.",
	"help_inGenFrame_number": "The recommended settings for this generator are #1# frames for 1 color, #2# frames for a 2 color gradient and #3# frames for a full gradient.",
	"help_inGenFrame_number1": "The recommended setting for this generator is #1# frames.",

	"help_sliderRandomizerHue": "Set the range of the random hue change. Example: At a setting of '60&deg; +/-', a yellow LED (60&deg;) can change to any color from red (0&deg;) to green (120&deg;). At a setting of '180&deg; +/-' random hues from the full color spectrum are assigned to the active LEDs.",
	"help_sliderRandomizerSat": "Set the range of random saturation change. Example: At a setting of '20% +/-', an LED with a saturation of 50% can change to any saturation from 30% to 70%. At a setting of '100% +/-', random values from pure white to full color are assigned to the active LEDs.",
	"help_sliderRandomizerBright": "Set the range of random brightness change. Example: At a setting of '20% +/-', an LED with a brightness of 50% can change to any brightness from 30% to 70%. At a setting of '100% +/-', random values from 'off' to full brightness are assigned to the active LEDs.",
	"help_sliderRandomizerPosition": "Set the range of the random position change. With a value of '12 +/- ', all positions are possible.",
	"help_but_randomizer_accept": "Apply the above settings according to the LED and frame permissions listed on the right.",
	"help_checkAllFramesRandomizer": "Check this option to apply the settings to all frames. Normally, only the selected frame is edited.",
	"help_checkEachLedRandomizer": "Check this option to apply the settings to each individual LED. Normally, all LEDs in a frame are edited equally.",

	"help_but_select_editor": "",

	"help_but_color_select_type0": "Choose the advanced color selection. Here you can set tint, saturation and brightness of a color very accurately. This makes it possible to choose from more than 3 million color tones.",
	"help_but_color_select_type1": "Choose the color palette to quickly select from 475 color tones.",
	"help_ledPrev": "Neighboring LEDs can be enabled for comparison. You can choose 'Same', 'Inverted' or 'Off'",
	"help_sliderColorVal": "Set the brightness.",
	"help_sliderColorSat": "Set the color saturation.",
	"help_sliderColorHue": "Choose a color tone.",
	"help_but_set_user_color": "Save the set color as a personal preset. You can save 24 favorite colors so you can quickly select them later.",
	"help_colUser_A": "Select personal color preference #1#.",
	"help_colUser_B": "Save the set color as personal preference #1#.",
	"help_colPreset": "Standard color preselection.",
	"help_colorDirectSelect": "Enable this setting when you want to select a palette color, a personal color preference, or a default color immediately.",
	"help_but_color_select_accept": "Use the set color for further editing.",
	"help_but_color_select_cancel": "Leave the color selection without choosing a different color.",

	"help_but_settings": "Open the general LEDitor settings.",
	"help_but_settings_cancel": "Close the general LEDitor settings.",
	"help_settingGammaR": "Gamma corrects the display of brightness and colors on the screen to match the colors of the LED Ring. Depending on the screen settings, a useful correction can be expected with a value between 1.5 and 3. Without correction (value 1), brightness and certain colors are not displayed correctly on the screen.",
	"help_settingGammaLink": "Use the same gamma value for red, green and blue. This will be sufficient in most cases. Turn off the link to set gamma for each main color separately.",
	"help_settingControlInfo": "At the top of the page, information about the controls is displayed (via text like this). Enable or disable the display of this information.",
	"help_settingShowHomey": "The edits you make are displayed through Homey's LED Ring."
 }
}
