{
 "settings": {
	"intro": "biedt de mogelijkheid om eigen LED Ring animaties te maken. De animaties kunnen met flow-kaarten geselecteerd worden en gedurende een instelbare tijd worden afgespeeld.",
	"header_editor": "LED editor",
	"header_frame": "&nbsp;Frame",
	"header_colors": "&nbsp;Kleur patroon",
	"header_generator": "Animatie generator",
	"header_export": "Bewaar LEDitor animatie",
	"header_settings": "LEDitor instellingen",
	"txt_empty_preset": "Nieuw",
	
	"title_but_copy_ani": "Kopie modus",
	"title_dropAnimation": "Selecteer animatie",
	"title_but_rename_ani": "Hernoem",
	"title_butPlay": "Afspelen op het beeldscherm",
	"title_butPreview": "Afspelen op de LED-ring",

	"title_but_ani_store": "Bewaar een LEDitor animatie.",
	"title_but_ani_open": "Open een LEDitor animatie.",
	"title_but_image_import": "Afbeelding als bron voor animatie",
	"title_but_frame_add": "Een nieuw frame toevoegen na frame ###",
	"title_but_frame_copy": "Dupliceer frame ###",
	"title_but_ani_fill_flow": "Lege frames vullen met kleurverloop. Vaste positie.",
	"title_but_ani_fill_connect": "Lege frames vullen met kleurverloop. Variabele positie.",
	"title_but_ani_delete": "Wis deze animatie",

	"title_but_ani_generator": "Animatie generator",
	"title_but_generator_close": "Keer terug naar de editor",

	"title_but_frame_clock": "Met de klok mee verplaatsen",
	"title_but_frame_counterclock": "Tegen de klok in verplaatsen",
	"title_but_frame_push": "Naar achter verplaatsen",
	"title_but_frame_pull": "Naar voren verplaatsen",
	"title_but_edit_fill": "Effen vulling",
	"title_but_edit_flow": "Kleurverloop vulling",

	"title_dropFillType": "Soort bewerking",
	"title_dropFillRange": "Bereik van bewerking",
	"title_but_color_acquire": "Gebruik de kleur van een LED",

	"title_but_color_select_type": "Schakel tussen pallet en geavanceerde kleurselectie",
	"title_but_color_select_cancel": "Kleurselectie annuleren",
	"title_but_color_select_accept": "Gebruik geselecteerde kleur",

	"title_but_settings": "LEDitor instellingen",
	"title_but_edit_undo": "Ongedaan maken",
	"title_but_edit_redo": "Opnieuw bewerken",

	"title_but_open_image": "Open een afbeelding",
	"title_but_scan_direction": "Scanrichting",
	"title_but_import_cancel": "Annuleer",
	"title_but_import_accept": "Accepteer",

	"txt_check_all_frames": "Alle frames",

	"frame_count": "Frames",
	"txt_move_up": "Verplaats omhoog",
	"txt_move_down": "Verplaats omlaag",
	"txt_remove": "Verwijder",
	"txt_off": "Uit",
	"txt_same": "Hetzelfde",
	"txt_inverted": "Ge&iuml;nverteerd",

	"txt_processing": "Bewerking",
	"txt_solid": "Effen",
	"txt_led_setting": "LED instelling",
	"txt_range": "Bereik",
	"txt_drop_type_1": "Een of meer",
	"txt_drop_type_2": "Verspring naar...",
	"txt_drop_type_3": "Kleurverloop vulling",
	"txt_drop_range_t1": "### LED",
	"txt_drop_range_t2": "iedere ### LED",
	"txt_drop_range_t3": "inactieve LED's",
	"txt_plural_s": "'s",
	"txt_select": "Selecteer",

	"txt_first_color": "Eerste kleur",
	"txt_second_color": "Tweede kleur",
	"txt_third_color": "Derde kleur",
	"txt_flow_to": "Verloop naar",
	"txt_ring_color": "Ring kleur",

	"txt_random_colors": "Willekeurige kleuren",
	"txt_full_flow": "Volledig verloop",
	"txt_set_user_color": "Bewaar kleurvoorkeur",
	"txt_no_color": "Geen kleur - LED uit",
	"txt_pure_red": "rood",
	"txt_pure_green": "groen",
	"txt_pure_blue": "blauw",
	"txt_pure_yellow": "geel",
	"txt_pure_magenta": "magenta",
	"txt_pure_cyan": "cyaan",
	"txt_bright_white": "wit",
	"txt_direct_select": "Direct selecteren",

	"count0": "iedere",
	"count1": "1e",
	"count2": "2e",
	"count3": "3e",
	"count4": "4e",
	"count5": "5e",
	"count6": "6e",
	"count7": "7e",
	"count8": "8e",
	"count9": "9e",
	"count10": "10e",
	"count11": "11e",
	"count12": "12e",
	"txt_ledring": "LED-ring weergave is bij benadering",

	"txt_import_start": "Begin hier en open een afbeelding.",
	"txt_led_colors": "Ge&iuml;mporteerde kleuren",
	"txt_image_selection": "Afbeelding selectie",
	"txt_dimmer": "Dimmer",
	"txt_hue": "Tint",
	"txt_saturation": "Verzadiging",
	"txt_lightness": "Lichtheid",
	"txt_brightness": "Helderheid",
	"txt_zoom": "Zoom",
	"txt_wrong_image": "bevat geen geldige LEDitor informatie!",
	"txt_left_right": "Links naar rechts",
	"txt_top_bottom": "Boven naar onder",

	"txt_save_animation": "Klik op de afbeelding hierboven om de LEDitor animatie op te slaan.<br><br>Met Homey Desktop krijg je een dialoogvenster te zien om te selecteren waar je de afbeelding wilt opslaan.<br><br>Google Chrome slaat de afbeelding direct op in de standaard downloadmap.<br>Als je met Chrome een dialoogvenster wil zien, rechts-klik dan op de afbeelding en selecteer 'Link opslaan als...'.<br><br>Iedereen kan deze animatie met LEDitor openen, inclusief alle bijbehorende instellingen. <br>Bewerk deze afbeelding later niet, omdat dit de instellingen zal beschadigen!",

	"txt_generator_0": "* Kies generator *",
	"txt_generator_1": "Alarm",
	"txt_generator_2": "Flits",
	"txt_generator_3": "Effen",
	"txt_generator_4": "Ademend",
	"txt_generator_5": "Fonkeling",
	"txt_generator_6": "Satelliet",
	"txt_generator_7": "Vuurtoren",
	"txt_generator_8": "Uurwerk",
	"txt_generator_9": "Vlinder",
	"txt_generator_10": "Driehoek",
	"txt_generator_11": "Pulstrein",
	"txt_generator_12": "Frontale puls",
	"txt_generator_13": "Pulsar",
	"txt_generator_14": "Tegenligger",
	"txt_generator_15": "Newton lichten",
	"txt_generator_16": "Scanner",
	"txt_generator_17": "Gort",
	"txt_generator_18": "Ogen",

	"txt_settings_gamma": "Gamma voor LED kleuren op het scherm",
	"txt_settings_show_info": "Toon bedienings informatie",
	"txt_settings_show_homey": "Toon LED bewerkingen op Homeys LED-Ring",
	"txt_settings_show_homey_time_pre": "gedurende",
	"txt_settings_show_homey_time_post": "seconden",

	"message_load_animation": "Animatie openen...",
	"message_prepare_animation": "Beeldscherm animatie voorbereiden...",
	"message_send_animation": "Animatie naar Homey sturen...",

	"help_but_copy_ani_A": "Activeer kopie modus om de geselecteerde animatie te vervangen door een kopie van de opvolgende selectie.<br>Voorbeeld: Kies animatie 1, activeer kopie-modus, kies animatie 3. Animatie 1 wordt nu vervangen door een kopie van animatie 3.",
	"help_but_copy_ani_B": "Deactiveer kopie modus.",
	"help_dropAnimation_A": "Selecteer een animatie. Eventuele wijzigingen aan de huidige animatie kunnen hierna niet meer automatisch ongedaan gemaakt worden. Handmatige bewerking blijft vanzelfsprekend altijd mogelijk.",
	"help_dropAnimation_B": "KOPIE MODUS: De huidige animatie wordt vervangen door een kopie van de te selecteren animatie.",
	"help_but_rename_ani": "Wijzig de naam van de geselecteerde animatie. Naast letters en cijfers zijn de meeste leestekens toegestaan. Toets [Enter] om de nieuwe naam aan de animatie toe te kennen, of toets [Esc] om te annuleren en de huidige naam te behouden.",
	"help_inName": "Voer hier een nieuwe naam in en toets [Enter]. Toets [Esc] om te annuleren.",
	"help_inFPS": "FPS = Frames Per Seconde. Deze instelling bepaalt hoeveel LED-frames per seconde worden weergegeven.",
	"help_inTFPS": "VFPS = Virtuele Frames Per Seconde. Deze instelling bepaalt de uiteindelijke snelheid waarmee de LED-ring verandert. Wanneer VFPS hoger is dan FPS, zal Homey de ontbrekende frames tussenvoegen. Een waarde die gelijk is aan FPS zorgt voor een onmiddelijke frame wisseling. Een hoge instelling (vanaf 25-30 VFPS) levert een vloeiende weergave op.",
	"help_inRPM": "RPM = Rotaties Per Minuut. Hoeveel keer per minuut voltooid de gehele animatie een omwenteling. 0 = stilstand met LED 1 naar voren gericht. Bij positieve waardes draait de ring met de klok mee en bij negatieve waardes draait de ring tegen de klok in.",
	"help_butPlay": "Speel een voorbeeld animatie op het beeldscherm. Dit kan handig zijn wanneer Homey niet beschikbaar is. Deze weergave is slechts bij benadering gelijk aan de weergave met de daadwerkelijke LED-ring.",
	"help_butPreview": "Speel de animatie met Homey. Je kunt eventueel een aantal herhalingen instellen zodat de overgang van het einde naar het begin van de animatie duidelijk zichtbaar wordt.",
	"help_inRepeat": "Hoeveel keer moet Homey de test animatie herhalen.",
	"help_tableFrames": "Dit is een weergave van de frames. Grotere markeringen tonen LED's 1 (front), 7 (links), 13 (achter) en 19 (rechts). LED 1 is in het midden zichtbaar terwijl LED 13 zowel links als rechts op de balk zichtbaar is om de cirkelvormige werkelijkheid te benadrukken. Selecteer een frame om in de ring-weergave te bekijken en eventueel aanpassingen te doen.",

	"help_butTopColor": "Kies een achtergrondkleur voor de schermweergaves. Mogelijk zijn zwart, 33% grijs, 66% grijs en wit. Dit kan helpen voor een betere herkenning van erg donkere of zeer felle, wit-achtige kleuren.",
	"help_ledMarker_A": "Bewerking uitvoeren. Beweeg de muis over deze LED markeringen om te zien welke LED's met de huidige instelling worden bewerkt. Klik op een markering om de ingestelde bewerking uit te voeren.",
	"help_ledMarker_B": "Kleur overnemen. Beweeg de muis over deze LED markeringen om te zien welke kleur zal worden overgenomen. Klik op een markering om de kleur over te nemen en te gebruiken voor verdere bewerkingen.",
	"help_colPreview": "Selecteer een bewerkingskleur of kies voor 'uit'. Je kunt hierbij gebruik maken van een pallet met 19 kleurtinten in diverse helderheden, of omschakelen naar de geavanceerde kleurinstellingen om je voorkeurstinten exact in te stellen",
	"help_but_color_acquire": "Schakel deze functie in en klik op een LED markering om de kleur te gebruiken als de bewerkingskleur.",
	"help_dropFillType": "Kies een type bewerking.",
	"help_dropFillType1": "'#1#' = Bewerk 1 LED of een aantal opeenvolgende LED's.",
	"help_dropFillType1ext": "",
	"help_dropFillType2": "'#2#' = Een of meer LED's overslaan voordat de volgende wordt bewerkt.",
	"help_dropFillType2ext": "",
	"help_dropFillType3": "'#3#' = Een groep uitgeschakelde LED's tussen 2 ingeschakelde LED's krijgt een kleurverloop vulling.",
	"help_dropFillType3ext": "Wanneer slechts 1 LED is ingeschakeld of wanneer de twee aangrenzende ingeschakelde LED's dezelfde kleur hebben, dan zal een effen vulling worden uitgevoerd.",
	"help_dropFillRange": "Selecteer het bereik voor de bewerking",

	"help_but_frame_clock": "Verplaats de kleuren met de klok mee.",
	"help_but_frame_counterclock": "Verplaats de kleuren tegen de klok in.",
	"help_but_frame_push": "Verplaats de kleuren links en rechts naar achteren. LED's 1 en 13 veranderen niet.",
	"help_but_frame_pull": "Verplaats de kleuren links en rechts naar voren. LED's 1 en 13 veranderen niet.",
	"help_but_edit_fill": "Effen vulling. Iedere uitgeschakelde LED krijgt dezelfde kleur als de voorgaande LED.",
	"help_but_edit_flow": "Kleurverloop vulling. Alle uitgeschakelde LED's vormen een kleurverloop tussen de ingeschakelde LED's. In tegenstelling tot de functie 'Kleurverloop vulling', bewerkt deze functie alle niet aaneengesloten uitgeschakelde secties tegelijk.",
	"help_dropFlowType": "Een kleurverloop vulling kan op drie manieren worden uitgevoerd. TVH 1: Tint, Verzadiging en Helderheid van de begin-LED worden naar de waardes van de eind-LED geregeld over de kortste afstand op de kleurcirkel. TVH 2: Als TVH 1, maar over de langste afstand op de kleurencirkel. RGB: Regelt de Rood, Groen en Blauw waardes van de begin-LED naar de waardes van de eind-LED.",
	"help_checkAllFrames": "Roteer of vul alle frames tegelijk.",
	"help_but_ani_open": "Open een LEDitor animatie. Deze PNG-bestanden bevatten behalve de kleuren voor de LED's ook de animatie-naam en de instellingen voor FPS, VFPS en RPM. De huidige animatie #1# (#2#) zal vervangen worden door de geopende animatie.",
	"help_but_ani_store": "Bewaar LEDitor animatie #1# (#2#). Deze wordt opgeslagen als PNG-afbeelding en bevat behalve de kleuren voor de LED's ook de animatie-naam en de instellingen voor FPS, VFPS en RPM. Deze afbeeldingen kunnen worden gebruikt als back-up en met andere gebruikers worden gedeeld.",
	"help_but_export_cancel": "Verlaat animatie export en keer terug naar de editor.",

	"help_but_ani_generator": "Met de animatiegenerator kun je met een paar muisklikken een LED-ring animatie genereren. Je kunt kiezen uit alle patronen van de 'LED-Ring Collection' en zelf de kleuren en een aantal parameters instellen.",
	"help_but_generator_close": "Keer terug naar de LED-ring editor voor handmatige aanpassingen.",
	"help_but_frame_add": "Een nieuw frame toevoegen na het geselecteerde frame.",
	"help_but_frame_copy": "Een kopie toevoegen na het geselecteerde frame.",
	"help_but_ani_fill_flow": "Frames zonder actieve LED's worden gevuld met een kleurverloop dat wordt samengesteld uit de kleuren van de naastliggende frames met actieve LED's.",
	"help_but_ani_fill_connect": "Frames zonder actieve LED's worden gevuld met een kleurverloop dat wordt samengesteld uit de kleuren van de naastliggende frames met actieve LED's. De positie van de actieve LED's in het frame voorgaand aan de niet actieve sectie, zal hierbij veranderen naar de positie van de meest nabije actieve LED in het frame dat volgt op de uitgeschakelde sectie.",
	"help_but_ani_delete": "Verwijder alle frames van deze animatie en begin met het maken van een nieuwe animatie.",
	"help_but_image_import": "Een afbeelding gebruiken als bron voor een animate. Animatie #1# (#2#) zal worden vervangen door frames welke worden gevormd uit de pixels van een zelf te kiezen afbeelding. Gebruik diverse instellingen om de kleuren aan te passen. Het aantal frames is instelbaar van 1 t/m 200.",
	"help_but_edit_undo": "Maak de laatste bewerking ongedaan. Dit is mogelijk totdat je een andere animatie selecteert of deze instellingen-pagina verlaat.",
	"help_but_edit_redo": "Voer de ongedaan gemaakte bewerking opnieuw uit. Dit is mogelijk totdat je een andere animatie selecteert of deze instellingen-pagina verlaat.",

	"help_sliderDimmer": "Gebruik Dimmer om de oorspronkelijke kleuren donkerder te maken. Dit voorkomt dat aangrenzende kleuren teveel met elkaar mengen, wat kan resulteren in een saaie bijna wit oplichtende LED-ring. Gebruik je muiswiel of cursortoetsen voor de fijnafstelling. Een dubbelklik stelt de standaardwaarde in.",
	"help_sliderHue": "Met Tint kun je het kleurenspectrum van een afbeelding aanpassen. Gebruik je muiswiel of cursortoetsen voor de fijnafstelling. Een dubbelklik stelt de standaardwaarde in.",
	"help_sliderSaturation": "Gebruik Verzadiging om doffe kleuren helderder te maken en vice versa. Gebruik de minimale instelling voor grijstinten / wit-niveau's. Gebruik je muiswiel of cursortoetsen voor de fijnafstelling. Een dubbelklik stelt de standaardwaarde in.",
	"help_sliderLightness": "Met Lichtheid worden de kleuren donkerder of feller gemaakt. Hierbij worden donkere tinten meer be&iuml;nvloed dan lichte tinten. Gebruik je muiswiel of cursortoetsen voor de fijnafstelling. Een dubbelklik stelt de standaardwaarde in.",
	"help_sliderZoom": "Gebruik Zoom om een bepaald deel van een afbeelding te vergroten. De laatste muisklik in een afbeelding bepaalt het centrum van de vergroting. Gebruik je muiswiel of cursortoetsen voor de fijnafstelling. Een dubbelklik toont de volledige afbeelding.",
	"help_but_open_image": "Open een afbeelding als bron voor frames en LED-kleuren.",
	"help_but_scan_direction": "Selecteer of de frames van links naar rechts, of van boven naar onder worden ingescand.",
	"help_inFrames": "Bepaal het aantal frames waarin de selectie wordt opgedeeld.",
	"help_canvImage": "Klik op de afbeelding om het middelpunt van het te gebruiken deel te bepalen. Dit is tevens het punt waarop eventueel wordt ingezoomd.",
	"help_importArea": "Dit deel van de afbeelding wordt gebruikt om de frames en kleuren te importeren en toont tevens de gamma correctie voor beeldscherm / LED's en eventuele handmatige kleuraanpassingen. Beweeg de muis in de lengte-richting om de frames in de matrix-weergave te bekijken.",
	"help_canvImportedFrames": "Hier zie je hoe de kleuren uit een afbeelding in frames worden gebruikt. Frames worden van boven naar onder weergegeven. Per frame worden de 24 LED-kleuren van links naar rechts afgebeeld. Uitgeschakelde LED's worden weergegeven met een punt. De centrale verticale markering toont de positie van LED 1.",
	"help_but_import_cancel": "Keer terug naar de editor zonder de afbeelding te importeren. Zolang je de LEDitor-instellingen niet verlaat, kun je hier terugkeren om verder te werken met de huidige afbeelding.",
	"help_but_import_accept": "Accepteer de weergegeven instellingen. Animatie #1# (#2#) zal worden vervangen door de gekozen afbeelding frames. Zolang je de LEDitor-instellingen niet verlaat, kun je hier terugkeren om aanpassingen te doen.",

	"help_dropGenerator":"Selecteer een generator.",
	"help_checkRandomColors":"Gebruik willekeurige kleuren voor de generator.",
	"help_checkFullFlow":"Gebruik een volledig kleurverloop (rood, geel, groen, cyaan, blauw en magenta) voor de generator.",
	"help_generatorCol1":"Selecteer de eerste kleur voor de generator.",
	"help_generatorCol1_flow": "Wanneer de tweede kleur niet -uit- is, dan zal de eerste kleur het begin zijn van een kleurverloop naar de tweede kleur.",
	"help_generatorCol2":"Selecteer de tweede kleur voor de generator.",
	"help_generatorCol2_flow": "Dit is de eindkleur voor een 2 kleuren verloop.",
	"help_generatorCol3": "Selecteer de derde kleur voor de generator.",
	"help_inGenFrame": "Hoeveel frames worden er gebruikt voor de animatie.",
	"help_inGenFrame_number": "De aanbevolen instellingen voor deze generator zijn #1# frames voor 1 kleur, #2# frames voor een 2 kleuren verloop en #3# frames voor een volledig verloop.",
	"help_inGenFrame_number1": "De aanbevolen instelling voor deze generator is #1# frames.",

	"help_but_color_select_type0": "Kies de geavanceerde kleurselectie. Hier kun je tint, verzadiging en helderheid van een kleur zeer nauwkeurig instellen. Hierdoor is het mogelijk om uit ruim 3 miljoen kleurtinten te kiezen.",
	"help_but_color_select_type1": "Kies het kleurenpalet om snel een keuze te maken uit 475 kleurtinten.",
	"help_ledPrev": "Naastliggende LED's kunnen ter vergelijking worden ingeschakeld. Mogelijk zijn 'Hetzelfde', 'Ge&iuml;nverteerd' of 'Uit'",
	"help_sliderColorVal": "Stel de helderheid in.",
	"help_sliderColorSat": "Stel de kleur verzadiging in.",
	"help_sliderColorHue": "Kies een kleurtint.",
	"help_but_set_user_color": "Bewaar de ingestelde kleur als persoonlijke voorkeur. Je kunt 24 favoriete kleuren opslaan zodat je deze later snel kunt seleceren.",
	"help_colUser_A": "Selecteer persoonlijke kleur voorkeur #1#.",
	"help_colUser_B": "De ingestelde kleur opslaan als persoonlijke voorkeur #1#.",
	"help_colPreset": "Standaard kleur voorkeuze selectie.",
	"help_colorDirectSelect": "Activeer deze instelling wannneer je een palletkleur, een persoonlijke kleur voorkeur, of een standaardkleur onmiddelijk wilt selecteren.",
	"help_but_color_select_accept": "Gebruik de ingestelde kleur voor verdere bewerkingen.",
	"help_but_color_select_cancel": "Verlaat de kleurselectie zonder een andere kleur te kiezen.",

	"help_but_settings": "Open de algemene LEDitor instellingen.",
	"help_but_settings_cancel": "Sluit de LEDitor instellingen.",
	"help_settingGammaR": "Gamma corrigeert de weergave van helderheid en kleuren op het beeldscherm zodat deze overeenkomen met de kleuren van de LED Ring. Afhankelijk van de beeldscherm instellingen, is een goede correctie te verwachten met een waarde tussen 1,5 en 3. Zonder correctie (waarde 1) worden helderheid en bepaalde kleuren niet correct op het scherm weergegeven.",
	"help_settingGammaLink": "Gebruik dezelfde gamma waarde voor rood, groen en blauw. Dit zal in de meeste gevallen voldoen. Schakel de link uit om gamma voor iedere hoofdkleur afzonderlijk in te stellen.",
	"help_settingControlInfo": "Bovenaan de pagina wordt (via tekst als deze) informatie over de bedieningselementen getoond. Schakel de weergave van deze informatie aan of uit.",
	"help_settingShowHomey": "De bewerkingen die je uitvoert worden via Homey's LED-Ring zichtbaar gemaakt."
 }
}
